# target_keywords = [
#     r'采购代理机构\b',
#     r'招标代理机构\b',
#     r'招标代理公司\b',
#     r'代\s*理\s*机\s*构\b',
#     r'招\s*标\s*代\s*理\b',
#     r'采\s*购\s*代\s*理\b',
#     r'联系人（代理机构）\b',
#     r'代\s*理\s*单\s*位\b',
#     r'代\s*理\s*机\s*构\b',
#     r'代\s*理\s*人\b',
#     r'代\s*理\s*公\s*司\b',
#     r'委\s*托\s*机\s*构\b',
#     r'委\s*托\s*公\s*司\b',
#     r'委\s*托\s*单\s*位\b',
#     r'竞\s*价\s*代\s*理\b',
#     r'代\s*理\s*中\s*介\b',
#     r'服\s*务\s*中\s*介\b',
# ]


target_keywords = [
    "采购代理机构",
    "招标代理机构",
    "招标代理公司",
    "代理机构(:|：){1}",
    "招标代理\\b",
    "采购代理\\b",
    "联系人（代理机构）(:|：){1}",
    "代理单位",
    "代理机构",
    "代理人",
    "代理公司",
    "委托机构",
    "委托公司",
    "委托单位",
    "竞价代理",
    "代理中介",
    "服务中介",
    "招标代理名称",
]

similar_words = [
    '采购管理中心',
    '采购中心',
    '交易中心',
    '招标中心',
    '代理中心',
    '咨询中心',
    '招投标中心',
    '招标有限责任公司',
    '招标有限公司',
    '招投标管理有限公司',
    '招投标有限公司',
    '代理有限责任公司',
    '代理有限公司',
    '项目管理服务有限公司',
    '项目管理有限公司',
    '工程管理有限公司',
    '咨询集团有限公司',
    '咨询服务有限公司',
    '咨询有限公司',
    '事务所'
]

agent_words = [
    r"代理联系人\b",
    r"联系人姓名\b",
    r"联系人名称\b",
    r'代理机构联系方式\b',
    r'联\s*系\s*方\s*式\b',
    r"联\s*系\s*人\b",
    r"姓\s*名\b",
    '联 系 人',
    '联系人和电话',
    '项目负责人',
    '经办人',
]

agent_contact_words = [
    r"代理联系方式",
    r"代理联系电话",
    r"代理机构联系方式",
    r"联\s*系\s*电\s*话",
    r"\b联\s*系\s*方\s*式\b",
    r"\b联\s*系\s*方\s*法",
    r"电\s*话",
    r"座\s*机",
    r"手\s*机",
    r"联系方式",
]

black_words = [
    '中标',
    '供应商',
    '成交',
    '中选',
    '承包',
    '乙方',
    '竞拍',
    '竞价',
    '入围',
    '生产',
    '选取',
]

# phone_regexs = [
#     r'\d+-\d+-\d+',
#     r'\d+-\d+',
#     r'1\d{2}(\d{4}|\*{4})(\d{4}|\d{3})',
#     r'\d{5,15}'
# ]

phone_regexs = [
    # r'1\d{2}(\d{4}|\*{4})(\d{4}|\d{3})',
    r'\+\d{2}-\d*(-\d*)?',
    r'\d{3,4}-\d{3,}-\d*',
    # r'\d{4}-\d{7}',
    r'\d{4}-\d{7,8}(-\d{5})?',
    r'\d{3}-\d{8,9}|\d{4}-(\d{8}|\d{7})',
    r'(\([0]\d{2}|\d{4}\))(\d{6,7})',
    r'\b\d{10}-\d-\d{4}\b',
    r'\d{3,4}\s?-\s?\d{7,8}',
    r'\d{3}-\d{4}( |-)\d{4}',
    r'\d{8}-\d*',
    r'1\d{2}(\d{4}|\*{4})(\d{4}|\d{3})',
    r'\d{5,15}'
    # r'\d{5,20}'
]

rule_supplement_words = [
    r"代\s*理\s*联\s*系\s*人\b",
    r"代\s*理\s*联\s*系\s*人\s*姓\s*名\b",
    r"代\s*理\s*联\s*系\s*人\s*名\s*称\b",
    r"代\s*理\s*机\s*构\b",
    r"代\s*理\s*单\s*位\b",
    r"委\s*托\s*人\b"
]

family_name_words = ["王", "李", "张", "刘", "陈", "杨", "黄", "吴", "赵", "周", "徐", "孙", "马", "朱", "胡", "林", "郭", "何", "高", "罗",
                     "郑", "梁", "谢", "宋", "唐", "许", "邓", "冯", "韩", "曹", "曾", "彭", "肖", "蔡", "潘", "田", "董", "袁", "于", "余",
                     "蒋", "叶", "杜", "苏", "魏", "程", "吕", "丁", "沈", "任", "姚", "卢", "钟", "姜", "崔", "谭", "廖", "范", "汪", "陆",
                     "金", "石", "戴", "贾", "韦", "夏", "邱", "方", "侯", "邹", "熊", "孟", "秦", "白", "毛", "江", "闫", "薛", "尹", "付",
                     "段", "雷", "黎", "史", "龙", "钱", "贺", "陶", "顾", "龚", "郝", "邵", "万", "严", "洪", "赖", "武", "傅", "莫", "孔",
                     "别", "汤", "向", "常", "温", "康", "施", "文", "牛", "樊", "葛", "邢", "安", "齐", "易", "乔", "伍", "庞", "颜", "倪",
                     "庄", "聂", "章", "鲁", "岳", "翟", "申", "殷", "詹", "欧", "耿", "关", "覃", "兰", "焦", "俞", "左", "柳", "甘", "祝",
                     "包", "代", "宁", "符", "阮", "尚", "舒", "纪", "柯", "梅", "童", "毕", "凌", "单", "季", "成", "霍", "苗", "裴", "涂",
                     "谷", "曲", "盛", "冉", "翁", "蓝", "骆", "路", "游", "靳", "辛", "欧阳", "管", "柴", "蒙", "鲍", "华", "喻", "祁",
                     "房", "蒲", "滕", "萧", "屈", "饶", "解", "牟", "艾", "尤", "时", "阳", "阎", "穆", "应", "农", "司", "古", "吉", "卓",
                     "车", "简", "连", "缪", "项", "麦", "褚", "窦", "娄", "戚", "岑", "党", "宫", "景", "卜", "费", "冷", "晏", "卫", "席",
                     "柏", "米", "隋", "宗", "桂", "瞿", "全", "苟", "楼", "闵", "佟", "臧", "边", "卞", "姬", "邬", "和", "师", "仇", "栾",
                     "丘", "刁", "沙", "商", "寇", "荣", "巫", "郎", "桑", "丛", "甄", "敖", "虞", "仲", "池", "巩", "明", "佘", "查", "麻",
                     "苑", "迟", "邝", "封", "官", "谈", "鞠", "匡", "惠", "荆", "乐", "冀", "胥", "郁", "南", "班", "储", "芦", "原", "栗",
                     "燕", "楚", "鄢", "扬", "劳", "谌", "奚", "皮", "蔺", "粟", "冼", "盘", "满", "闻", "厉", "伊", "候", "仝", "区", "郜",
                     "海", "阚", "花", "权", "强", "帅", "屠", "朴", "盖", "练", "廉", "禹", "井", "巴", "漆", "祖", "丰", "支", "卿", "国",
                     "狄", "平", "计", "索", "宣", "晋", "相", "占", "初", "门", "云", "容", "敬", "来", "扈", "晁", "都", "芮", "普", "阙",
                     "戈", "浦", "伏", "薄"]
