#!/usr/bin/env python
# -*- coding: utf-8 -*-

# 拟中标	    中标单位联系人	    中标单位联系电话
# 中标单位	中标公司联系人	    中标公司联系电话
# 中标公司	中标联系人	    中标联系电话
# 中标人	    供应商单位联系人	供应商单位联系电话
# 供应商	    成交单位联系人	    成交单位联系电话
# 供应单位	供应商联系人	    供应商联系电话
# 成交单位	成交联系人	    成交联系电话
# 成交人	    成交人	        成交人联系电话
# 乙方	    联系人	        联系人电话
# 中标	    项目负责人	    联系人方式
# 成交	    项目主管	        联系方式
# 供应	    项目经理	        联络方式
# 	        姓名	            电话
# 	        联络人	        手机

target_keywords = [
    r"拟\s*中\s*标",
    r"中\s*标\s*单\s*位",
    r"中\s*标\s*公\s*司",
    r"中\s*标\s*人",
    r"供\s*应\s*商",
    r"供\s*应\s*单\s*位",
    r"承\s*包\s*单\s*位",
    r"承\s*包\s*人",
    r"成\s*交\s*单\s*位",
    r"成\s*交\s*人",
    r"乙\s*方",
    # r"供\s*应\s*商",
]

contact_person_words = [
    r"中标单位联系人\b",
    r"中标公司联系人\b",
    r"中标联系人\b",
    r"供应商单位联系人\b",
    r"成交单位联系人\b",
    r"供应商联系人\b",
    r"成交联系人\b",
    r"委托代理人\b",
    r"确\s*认\s*人\b",
    r"成\s*交\s*人\b",
    r"联\s*系\s*人\b",
    r"项目负责人\b",
    r"项目主管\b",
    r"项目经理\b",
    r"姓\s*名\b",
]

contact_number_words = [
    "中标单位联系电话",
    "中标公司联系电话",
    "中标联系电话",
    "供应商单位联系电话",
    "成交单位联系电话",
    "供应商联系电话",
    "成交联系电话",
    "成交人联系电话",
    "联系人电话",
    "联系人方式",
    "联系方式",
    "联络方式",
    "电话",
    "手机",
    '电 话',
    '电  话：',
    '供应商联系方式',
    # '中标供应商电话',
    # '成交供应商电话',
]

rule_supplement_words = [
    r"中\s*标\s*联\s*系\s*人",
    r"中\s*标\s*联\s*系\s*人\s*姓\s*名",
    r"中\s*标\s*联\s*系\s*人\s*名\s*称",
    r"中\s*标\s*机\s*构",
    r"中\s*标\s*单\s*位",
    r"中\s*标\s*人",
    r"供\s*应\s*商",
    r"承\s*包\s*商",
    r"承\s*包\s*人",
    r"承\s*包\s*单\s*位",
    r"供应商\S*电话",
    r"供应商\S*联系人",
    r"中标\S*电话",
    r"中标\S*联系人",
    r"承包\S*电话",
    r"承包\S*联系人",

]

family_name_words = ["王", "李", "张", "刘", "陈", "杨", "黄", "吴", "赵", "周", "徐", "孙", "马", "朱", "胡", "林", "郭", "何", "高", "罗",
                     "郑", "梁", "谢", "宋", "唐", "许", "邓", "冯", "韩", "曹", "曾", "彭", "肖", "蔡", "潘", "田", "董", "袁", "于", "余",
                     "蒋", "叶", "杜", "苏", "魏", "程", "吕", "丁", "沈", "任", "姚", "卢", "钟", "姜", "崔", "谭", "廖", "范", "汪", "陆",
                     "金", "石", "戴", "贾", "韦", "夏", "邱", "方", "侯", "邹", "熊", "孟", "秦", "白", "毛", "江", "闫", "薛", "尹", "付",
                     "段", "雷", "黎", "史", "龙", "钱", "贺", "陶", "顾", "龚", "郝", "邵", "万", "严", "洪", "赖", "武", "傅", "莫", "孔",
                     "别", "汤", "向", "常", "温", "康", "施", "文", "牛", "樊", "葛", "邢", "安", "齐", "易", "乔", "伍", "庞", "颜", "倪",
                     "庄", "聂", "章", "鲁", "岳", "翟", "申", "殷", "詹", "欧", "耿", "关", "覃", "兰", "焦", "俞", "左", "柳", "甘", "祝",
                     "包", "代", "宁", "符", "阮", "尚", "舒", "纪", "柯", "梅", "童", "毕", "凌", "单", "季", "成", "霍", "苗", "裴", "涂",
                     "谷", "曲", "盛", "冉", "翁", "蓝", "骆", "路", "游", "靳", "辛", "欧阳", "管", "柴", "蒙", "鲍", "华", "喻", "祁",
                     "房", "蒲", "滕", "萧", "屈", "饶", "解", "牟", "艾", "尤", "时", "阳", "阎", "穆", "应", "农", "司", "古", "吉", "卓",
                     "车", "简", "连", "缪", "项", "麦", "褚", "窦", "娄", "戚", "岑", "党", "宫", "景", "卜", "费", "冷", "晏", "卫", "席",
                     "柏", "米", "隋", "宗", "桂", "瞿", "全", "苟", "楼", "闵", "佟", "臧", "边", "卞", "姬", "邬", "和", "师", "仇", "栾",
                     "丘", "刁", "沙", "商", "寇", "荣", "巫", "郎", "桑", "丛", "甄", "敖", "虞", "仲", "池", "巩", "明", "佘", "查", "麻",
                     "苑", "迟", "邝", "封", "官", "谈", "鞠", "匡", "惠", "荆", "乐", "冀", "胥", "郁", "南", "班", "储", "芦", "原", "栗",
                     "燕", "楚", "鄢", "扬", "劳", "谌", "奚", "皮", "蔺", "粟", "冼", "盘", "满", "闻", "厉", "伊", "候", "仝", "区", "郜",
                     "海", "阚", "花", "权", "强", "帅", "屠", "朴", "盖", "练", "廉", "禹", "井", "巴", "漆", "祖", "丰", "支", "卿", "国",
                     "狄", "平", "计", "索", "宣", "晋", "相", "占", "初", "门", "云", "容", "敬", "来", "扈", "晁", "都", "芮", "普", "阙",
                     "戈", "浦", "伏", "薄"]

contact_filter_words = [
    "成交",
    "采购",
    "代理",
    "供应",
    "竞价",
    "供货",
    "承包",
    "质疑",
    "投诉",
    "投标人",
    "招标代理机构",
    "监督管理",
    "监督部门",
    "监督单位",
    "投诉部门",
    "投诉单位",
    "监督联系",
    "投诉联系"
]

phone_regexs = [
    r'1\d{2}(\d{4}|\*{4})(\d{4}|\d{3})',
    r'\+\d{2}-+\d*(-\d*)?',
    r'\d{3,4}-+\d{3,}-\d*',
    # r'\d{4}-\d{7}',
    r'\d{4}-+\d{7,8}(-\d{5})?',
    r'\d{3}-+\d{8}|\d{4}-(\d{8}|\d{7})',
    r'(\([0]\d{2}|\d{4}\))(\d{6,7})',
    r'\b\d{10}-+\d-\d{4}\b',
    r'\d{3,4}\s?-+\s?\d{7,8}',
    r'\d{3}-+\d{4}( |-)\d{4}',
    r'\d{8}-\d*',
    r'1\d{2}(\d{4}|\*{4})(\d{4}|\d{3})',
    r'\d{5,15}'
    # r'\d{5,20}'
]
